In [1]:
%CREATE challenge1_db.db

In [2]:
CREATE TABLE OCCUPATIONS (Name STRING, Occupation STRING)

In [3]:
INSERT INTO OCCUPATIONS (Name, Occupation) VALUES ("Samantha", "Doctor"),("Julia","Actor"),("Maria","Actor"),("Meera","Singer"),("Ashely","Professor"),
("Ketty","Professor"),("Christeen","Professor"),("Jane","Actor"),("Jenny","Doctor"),("Priya","Singer")

In [4]:
SELECT COUNT(*) as rowcount FROM OCCUPATIONS

+----------+
| rowcount |
+----------+
| 10       |
+----------+

In [5]:
SELECT Name || '(' || SUBSTR(Occupation,1,1) || ')' AS First_Query FROM OCCUPATIONS ORDER BY Name

+--------------+
| First_Query  |
+--------------+
| Ashely(P)    |
+--------------+
| Christeen(P) |
+--------------+
| Jane(A)      |
+--------------+
| Jenny(D)     |
+--------------+
| Julia(A)     |
+--------------+
| Ketty(P)     |
+--------------+
| Maria(A)     |
+--------------+
| Meera(S)     |
+--------------+
| Priya(S)     |
+--------------+
| Samantha(D)  |
+--------------+

In [6]:
SELECT 'There are a total of '|| count || ' ' || occupation || 's.' AS Second_Query FROM ( SELECT COUNT(*) as count,Occupation FROM OCCUPATIONS GROUP BY Occupation ORDER BY count,Occupation)

+------------------------------------+
| Second_Query                       |
+------------------------------------+
| There are a total of 2 Doctors.    |
+------------------------------------+
| There are a total of 2 Singers.    |
+------------------------------------+
| There are a total of 3 Actors.     |
+------------------------------------+
| There are a total of 3 Professors. |
+------------------------------------+